In [1]:
import pandas as pd

In [2]:
titanic_dataset = pd.read_csv('./datasets/titanic/train.csv')

In [3]:
titanic_dataset[:3] # first 3 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
titanic_dataset.isnull().sum() # counting missing data

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## 1. Drop

- we drop columns with 'too many missing values'
- in this case 'Cabin'

In [8]:
titanic_dataset.drop(columns=['Cabin'], inplace=True)

In [9]:
titanic_dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

## Mean, Median and Mode

calculating value of all 3 for 'Age' column

In [ ]:
print({
  'mean':titanic_dataset['Age'].mean(),
  'median':titanic_dataset['Age'].median(),
  'mode':titanic_dataset['Age'].mode()
})

## 2. Fill N/A with Mean

In [18]:
mean_filled = titanic_dataset
# mean_filled['Age'].fillna(mean_filled['Age'].mean(), inplace=True) # inappripriate method
mean_filled.fillna({'Age': mean_filled['Age'].mean()}, inplace=True) # right way
mean_filled.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C

## 3. Fill N/A with Median

In [19]:
median_filled = titanic_dataset
mean_filled.fillna({'Age': mean_filled['Age'].median()}, inplace=True)
median_filled.sample(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.000000,4,2,347082,31.275,S
846,847,0,3,"Sage, Mr. Douglas Bullen",male,29.699118,8,2,CA. 2343,69.550,S

## 4. Fill N/A with Mode

In [20]:
mode_filled = titanic_dataset
mean_filled.fillna({'Age': mean_filled['Age'].mode()}, inplace=True)
mode_filled.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C